import random

from src.config import settings
from src.schemes import Lider

names_one: list[str] = [    "Александр", "Сергей", "Дмитрий", "Андрей", "Алексей",
    "Максим", "Евгений", "Иван", "Михаил", "Артем",
    "Николай", "Владимир", "Игорь", "Владислав", "Денис",
    "Павел", "Антон", "Илья", "Никита", "Роман",
    "Олег", "Виталий", "Кирилл", "Егор", "Даниил",
    "Матвей", "Тимофей", "Ярослав", "Глеб", "Федор",
    "Георгий", "Степан", "Константин", "Артур", "Вадим",
    "Тимур", "Руслан", "Марат", "Анвар", "Алихан",
    "Нурлан", "Берик", "Арман", "Азамат", "Данияр",
    "Александр", "Дмитрий", "Иван", "Василий", "Петр",
    "Елена", "Ольга", "Татьяна", "Наталья", "Екатерина",
    "Анна", "Мария", "Ирина", "Светлана", "Юлия",
    "Анастасия", "Виктория", "Ксения", "Дарья", "Алина",
    "Полина", "София", "Елизавета", "Кристина", "Вероника",
    "Алена", "Маргарита", "Инна", "Яна", "Марина",
    "Надежда", "Любовь", "Вера", "Алла", "Лариса",
    "Диана", "Карина", "Эльвира", "Гульнара", "Айгуль",
    "Алия", "Мадина", "Амина", "Лейла", "Зарина",
    "Асель", "Жулдыз", "Анара", "Айсезим", "Камила",
    "Александра", "Евгения", "Валерия", "Милана", "Ульяна"]
names_two: list[str] = [ "кровать", "стул", "стол", "шкаф", "диван", "кресло", "зеркало", "ковёр",
    "лампа", "окно", "дверь", "стена", "ключ", "подушка", "одеяло", "картина",
    "ваза", "часы", "штороа", "книга", "нож", "вилка", "ложка", "тарелка",
    "чашка", "стакан", "сковорода", "кастрюля", "чайник", "ноутбук", "телефон",
    "плита", "холодильник", "солонка", "салфетка", "хлеб", "яблоко", "молоко",
    "вода", "сыр", "мясо", "рыба", "яйцо", "сахар", "соль", "масло",
    "лимон", "шоколад", "чай", "кофе", "платье", "брюки", "рубашка", "куртка",
    "пальто", "шапка", "шарф", "носок", "ботинок", "туфля", "юбка", "перчатка",
    "ремень", "кофта", "рюкзак", "автомобиль", "автобус", "поезд", "самолёт",
    "велосипед", "дорога", "мост", "здание", "фонарь", "светофор", "скамья",
    "забор", "кирпич", "рельс", "метро", "дерево", "цветок", "трава", "камень",
    "песок", "облако", "собака", "кошка", "птица", "лошадь", "рыба", "медведь",
    "заяц", "лист", "ветка", "карандаш", "ручка", "тетрадь", "молоток", "пила",
    "топор", "гвоздь", "ножницы", "линейка", "кисть"]

names_pool: list[str] = []


def create_fake_lid() -> list[Lider]:
    lid: list[Lider] = []
    for _ in range(settings.BASE_RANGE_LIDE):
        name_temporary_1 = random.choice(names_one)
        name_temporary_2 = random.choice(names_two)
        name_temporary_finale = name_temporary_1 + " " + name_temporary_2
        names_pool.append(name_temporary_finale)

    for _ in range(settings.BASE_RANGE_LIDE):
        name = random.choice(names_pool)
        score = random.randint(0, 1000)
        lid.append(Lider(name=name, score=score))

    return lid
